/*
 * Copyright (C) 2008-2014 Netronome Systems, Inc.  All rights reserved.
 */

/* NFP enhanced intrinsic function definitions */

#ifndef __NFP_OVERRIDE_H__
#define __NFP_OVERRIDE_H__

#ifndef NFP_LIB_ANY_NFCC_VERSION
    #if (!defined(__NFP_TOOL_NFCC) ||                       \
        (__NFP_TOOL_NFCC < NFP_SW_VERSION(5, 0, 0, 0)) ||   \
        (__NFP_TOOL_NFCC > NFP_SW_VERSION(6, 0, 2, 255)))
        #error "This standard library is not supported for the version of the SDK currently in use."
    #endif
#endif

/*
 * NOTE: When writing inline-asm, it's important not to use reserved words
 *       for variables.  Common ones are 'a','b', 'csr', 'state', and
 *       'inp_state'.
 */

/** @addtogroup indirect_ref Indirect Reference 32xx Formats and Intrinsics
 *  @{
 */

/* ME v2.7 indirect format definitions */
#ifdef __NFP_INDIRECT_REF_FORMAT_NFP3200

#if __BIGENDIAN

/* 13 indirect override formats are defined in MEv2.7 architecture */

/** Override all fields in NFP-32xx indirect format.
 *
 */
typedef union
{
    struct
    {
        unsigned int encoding       : 2; /**< 0x3.                                          */
        unsigned int reserved       : 1; /**< Reserved.                                     */
        unsigned int byte_mask      : 8; /**< Byte mask.                                    */
        unsigned int sig_ctx        : 3; /**< Signal context.                               */
        unsigned int master         : 5; /**< Signal and data master.                       */
        unsigned int xadd_imm       : 8; /**< Transfer register or immediate.               */
        unsigned int ref_count      : 5; /**< Number of bytes, long/quad-words to access    */
    };
    unsigned int value;                  /**< Accessor to all bits simultaneously.          */
} override_all_ind_t;

/** Override Xfer register only in NFP-32xx indirect format.
 */
typedef union
{
    struct
    {
        unsigned int encoding       : 4;    /**< 0x0.                                       */
        unsigned int reserved_1     : 9;    /**< Reserved.                                  */
        unsigned int xadd_imm       : 14;   /**< Transfer register or immediate.            */
        unsigned int reserved_2     : 5;    /**< Reserved.                                  */
    };
    unsigned int value;                     /**< Accessor to all bits simultaneously.       */
} override_xfer_imm_ind_t;

/** Override Xfer register and length in NFP-32xx indirect format.
 */
typedef union
{
    struct
    {
        unsigned int encoding       : 4;    /**< 0x1.                                        */
        unsigned int reserved_1     : 9;    /**< Reserved.                                   */
        unsigned int xadd_imm       : 14;   /**< Transfer register or immediate.             */
        unsigned int ref_count      : 5;    /**< Number of bytes, long/quad-words to access. */
    };
    unsigned int value;                     /**< Accessor to all bits simultaneously.        */
} override_xfer_imm_cnt_ind_t;

/** Override length only in NFP-32xx indirect format.
 */
typedef union
{
    struct
    {
        unsigned int encoding       : 4;    /**< 0x2.                                        */
        unsigned int reserved       : 23;   /**< Reserved.                                   */
        unsigned int ref_count      : 5;    /**< Number of bytes, long/quad-words to access. */
    } ;
    unsigned int value;                     /**< Accessor to all bits simultaneously.        */
} override_cnt_ind_t;

/** Override length and byte mask in NFP-32xx indirect format.
 */
typedef union
{
    struct
    {
        unsigned int encoding       : 4;    /**< 0x3.                                        */
        unsigned int reserved       : 15;   /**< Reserved.                                   */
        unsigned int ref_count      : 5;    /**< Number of bytes, long/quad-words to access. */
        unsigned int byte_mask      : 8;    /**< Mask of bytes to write.                     */
    };
    unsigned int value;                     /**< Accessor to all bits simultaneously.        */
} override_cnt_mask_ind_t;

/** Override byte mask only in NFP-32xx indirect format.
 */
typedef union
{
    struct
    {
        unsigned int encoding       : 4;    /**< 0x4.                                        */
        unsigned int reserved       : 20;   /**< Reserved.                                   */
        unsigned int byte_mask      : 8;    /**< Mask of bytes to write.                     */
    };
    unsigned int value;                     /**< Accessor to all bits simultaneously.        */
} override_mask_ind_t;

/** Override ME and context in NFP-32xx indirect format.
 */
typedef union
{
    struct
    {
        unsigned int encoding       : 4;    /**< 0x5.                                        */
        unsigned int reserved_1     : 1;    /**< Reserved.                                   */
        unsigned int master         : 8;    /**< Address of signal or data master.           */
        unsigned int ctx            : 3;    /**< Context.                                    */
        unsigned int reserved_2     : 16;   /**< Reserved.                                   */
    };
    unsigned int value;                     /**< Accessor to all bits simultaneously.        */
} override_me_ctx_ind_t;

/** Override ME, context and signal in NFP-32xx indirect format.
 */
typedef union
{
    struct
    {
        unsigned int encoding       : 4;    /**< 0x6.                                        */
        unsigned int reserved_1     : 1;    /**< Reserved.                                   */
        unsigned int master         : 8;    /**< Address of signal or data master.           */
        unsigned int ctx            : 3;    /**< Context.                                    */
        unsigned int sig            : 4;    /**< Signal number.                              */
        unsigned int reserved_2     : 12;   /**< Reserved.                                   */
    };
    unsigned int value;                     /**< Accessor to all bits simultaneously.        */
} override_me_ctx_sig_ind_t;

/** Override ME and Xfer register in NFP-32xx indirect format.
 */
typedef union
{
    struct
    {
        unsigned int encoding       : 4;    /**< 0x8 or 0x9.                                 */
        unsigned int reserved_1     : 1;    /**< Reserved.                                   */
        unsigned int master         : 8;    /**< Address of signal or data master.           */
        unsigned int xadd_imm       : 14;   /**< Transfer register or immediate.             */
        unsigned int reserved_2     : 5;    /**< Reserved.                                   */
    };
    unsigned int value;                     /**< Accessor to all bits simultaneously.        */
} override_me_xfer_imm_ind_t;

/** Override ME, Xfer register and context in NFP-32xx indirect format.
 */
typedef union
{
    struct
    {
        unsigned int encoding       : 4;    /**< 0xA or 0xB.                                 */
        unsigned int reserved_1     : 1;    /**< Reserved.                                   */
        unsigned int master         : 8;    /**< Address of signal or data master.           */
        unsigned int xadd_imm       : 14;   /**< Transfer register or immediate.             */
        unsigned int reserved_2     : 2;    /**< Reserved.                                   */
        unsigned int ctx            : 3;    /**< Context.                                    */
    };
    unsigned int value;                     /**< Accessor to all bits simultaneously.        */
} override_me_xfer_ctx_ind_t;

/** Override ME, Xfer register, context and length in NFP-32xx indirect format.
 */
typedef union
{
    struct
    {
        unsigned int encoding       : 4;    /**< 0x7                                         */
        unsigned int reserved_1     : 1;    /**< Reserved.                                   */
        unsigned int master         : 8;    /**< Address of signal or data master            */
        unsigned int ctx            : 3;    /**< Context                                     */
        unsigned int reserved_2     : 3;    /**< Reserved.                                   */
        unsigned int xadd_imm       : 8;    /**< Transfer register or immediate              */
        unsigned int ref_count      : 5;    /**< Number of bytes, long/quad-words to access  */
    };
    unsigned int value;                     /**< Accessor to all bits simultaneously.        */
} override_me_xfer_ctx_cnt_ind_t;

#else
/* __LITTLEENDIAN */

/* See BE description above */
typedef union
{
    struct
    {
        unsigned int ref_count      : 5;
